{
    "version": "https://jsonfeed.org/version/1",
    "title": "segwrites",
    "description": "",
    "home_page_url": "https://segwrites.com",
    "feed_url": "https://segwrites.com/feed.json",
    "user_comment": "",
    "icon": "https://segwrites.com/media/website/segwrites-logo-wb.png",
    "author": {
        "name": "Sara Eatherton-Goff"
    },
    "items": [
        {
            "id": "https://segwrites.com/when-the-time-is-right/",
            "url": "https://segwrites.com/when-the-time-is-right/",
            "title": "when the time is right",
            "summary": "I was ecstatic. I've had this novel idea floating around in my head for nearly three years. I'd contribute a scene to an index card here and there, and just go about life. Then, struck with this lightning-bolt of inspiration, I decided to start writing&hellip;",
            "content_html": "<div>I was ecstatic. <br><br></div>\n<div>I've had this novel idea floating around in my head for nearly three years. <br><br></div>\n<div>I'd contribute a scene to an index card here and there, and just go about life. <br><br></div>\n<div>Then, struck with this lightning-bolt of inspiration, I decided to start writing out the scope of the story. <br><br></div>\n<div>I told my husband he needed to figure something out for dinner because I was going to spend my evening finally getting the story outline down.<br><br></div>\n<div>I wrote for nearly two hours when a pesky little thought crept into mind: the setting, as it stands, is a character in the story. (I mean, to me, every setting is a character in every story. It's why early episodes of the TV show House irk me so badly—such a bad, uncomfortable set.) <br><br>But my setting-character is simultaneously interesting yet boring. Then, my motivation fizzled out.<br><br></div>\n<div>Several things went wrong that night: primarily mom-guilt for basically saying I wasn't going to cook,<em> I have better things to do.<br></em></div>\n<div>Another thing was letting the infancy of the fresh idea become tainted by the years I've tossed the story concept around for.<br><br></div>\n<div>I had other things going on. I didn't nurture this notion; I worked on everything else. And when the pilot light lit under my ass finally ignited, I expected the conglomeration of index card scenes to fully form a story in my first sitting..?<br><br></div>\n<div>Good luck with that.<br><br></div>\n<div>Although it's been three years, I haven't given this story legs yet.<br><br></div>\n<div>It's still just an idea, but one that’s now moved to the forefront.<br><br></div>\n<div>In the now defunct, pre-sexual-allegation <a href=\"https://www.masterclass.com/\"><strong>Masterclass</strong></a> of Neil Gaiman, he shared that he had the idea for <strong><em>The Graveyard Book </em></strong>while he was in college, and felt he wasn't quite ready yet as a writer to do the idea justice. And something like 20-some-odd years later, he finally wrote that shelved story.<br><br></div>\n<div>When he, the author, was finally ready.<br><br></div>\n<div>The thought of waiting until I'm \"ready” is nerve-wracking though. <br><br><em>What if someone gets the same idea, or that it's so close to mine that my depiction is therefore trash?<br></em></div>\n<div>For another novel idea I have, there is a popular novel called <a href=\"https://amzn.to/2RvcGUx\"></a><strong><em><a href=\"https://amzn.to/2RvcGUx\" target=\"_blank\" rel=\"noopener noreferrer\">Don't Look For Me</a></em></strong><strong><em>*</em></strong> where the blurb lead me to believe that it was \"my\" idea executed by someone quicker on the trigger. Luckily it wasn't even close. But still, the anxiety is palpable.<br><br></div>\n<div>It makes me question my whole approach—my \"strategy\"—with writing.<br><br></div>\n<div>As someone who has written and shelved two novels, ghostwritten for years, and has listened to published authors share their experiences: <strong>writing short fiction is harder than writing a novel.<br></strong></div>\n<div>Maybe I'm crazy for trying to master the art of the short first. Especially now that I'm “a year behind” with the pandemic. I'll read someone like <a href=\"https://laurengroff.com/about/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Lauren Groff</strong></a> who can pack a character's entire life into a single sentence, and that level of succinct mastery reassures me that I'm going about this the right way for me. Although I'm not there yet, it proves that it can be done and done beautifully. That the ability to write short-form work that leaves an impact in as few words as possible is an art form in and of itself.<br><br></div>\n<div><strong>No matter how much fresh doubt or imposter syndrome creeps in, I trust myself.<br></strong></div>\n<div>I made this plan three years ago, maybe a couple months before the \"mega novel idea” first struck me: I would focus on writing short stories first, then novels while still working on more short stories (to market and draw appeal for the novels, and to build more collections of stories later).<br><br></div>\n<div>Additionally, I’ve found that I tend to prefer the novels of authors who also write short stories. They are adept at brevity. Their novels are devoid of sloppy, meaningless sentences, saggy middles, and boring plots.<br><br></div>\n<div>They put in the work to craft concise, crisp prose, and that success pours into everything they write, no matter the length.<br><br></div>\n<div>All in all, although I'm excited about this novel idea, it's just not ready. And <em>I'm</em> not yet there as a sculptor of words to do the story justice.<br><br></div>\n<div>But I'm getting there. <br><br></div>\n<div>Every day I work toward that goal, and even if it takes me 20 years to write this particular novel, the story will be better because I didn't rush it; I didn't fake it. I did right by it.<br><br></div>\n<div><em>And</em> I did what's best for me (and my family) right now.<br><br>My best,</div>\n<div> </div>\n<div>Sara</div>\n<div>     support my work and | <a href=\"https://www.buymeacoffee.com/segwrites\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>“buy me a coffee”</strong></a><strong> </strong>(a one-time tip)</div>\n<div>     offer ongoing support and | <a href=\"https://patreon.com/segwrites?utm_medium=unknown&amp;utm_source=join_link&amp;utm_campaign=creatorshare_creator&amp;utm_content=copyLink\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>become a Patreon patron</strong></a><strong> </strong></div>\n<div>     get the | <a href=\"https://amzn.to/3XpjNKq?source=about_page-------------------------------------\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Content Strategy Planner</strong></a></div>\n<div> </div>\n<div><hr></div>\n<div>\n<section class=\"push_double--ends pad--bottom\">\n<article>\n<div class=\"trix-content\">\n<div> </div>\n<div><em>Note:</em> <em>any product listed with an asterisk(</em><strong><em>*</em></strong><em>) behind it is an affiliate link. By using that link to purchase, you provide a small commission at no extra cost to you. Although small, these little income boosts help to keep this newsletter going, as well as contribute toward some in-the-works projects. Thank you! I’m grateful.</em></div>\n</div>\n</article>\n</section>\n</div>",
            "image": "https://segwrites.com/media/posts/14/Handwriting-2021.jpg",
            "author": {
                "name": "Sara Eatherton-Goff"
            },
            "tags": [
                   "musing"
            ],
            "date_published": "2021-06-08T09:00:00-07:00",
            "date_modified": "2025-06-25T16:27:14-07:00"
        },
        {
            "id": "https://segwrites.com/then-it-was-over/",
            "url": "https://segwrites.com/then-it-was-over/",
            "title": "then it was over",
            "summary": "I. She fidgeted in her chair beside my hospital bed. She would go between reading her romance novel, setting it down, then out for a cigarette. Then pacing the room. Reading. Then out for another smoke. I couldn’t talk. I had a tube down my&hellip;",
            "content_html": "<h1 class=\"align-center\">I.</h1>\n<div>She fidgeted in her chair beside my hospital bed. She would go between reading her romance novel, setting it down, then out for a cigarette. Then pacing the room. Reading. Then out for another smoke. <br><br></div>\n<div>I couldn’t talk. I had a tube down my nose, dry-scraping my esophagus with every micro-movement; pumping bile from my stomach.<br><br></div>\n<div>I spent days unable to speak, mindlessly staring at a television screen with the remote out of reach. <br><br>My mom stayed with me until the tube came out, abrading its way up my throat and out of my nostril; burning; the taste of vomit, acid.<br><br></div>\n<div>Right after the surgery, my mom's stepmother's latest husband said they had cut open my stomach and took out all my guts and put them on a small table. Then they combed through my intestines until they found the tiny appendix. They snipped it off, \"burnt it\", then shoved all my guts back inside my body before stitching me up. <br><br></div>\n<div>I was fourteen.<br><br></div>\n<div>I thought of my insides, all red and bulbous, getting cold and drying out on a stainless steel tray while I watched my mom fidget. She chewed her nails, then caught me watching her. She smiled, warming me inside, and gently patted my forearm. <br><br>My stomach clenched.<br><br></div>\n<div>I couldn't speak for a couple days after the tube came out. She fidgeted more, stopping only after she asked me if I minded if she returned to work. She was falling behind, she said. I croaked an OK and she said she loved me. Then she went back out for a cigarette.<br><br></div>\n<div>It had been the longest time we stayed in the same room together. Alone. <br><br></div>\n<div>That experience made me intrepid toward hospitals. People coming in to take care of me, checking in on me. Smiling. Caring. I spent five days in my bedroom, alone. I spent what felt like years alone—my entire childhood. And even though I knew this attention was fleeting, and probably within a month after we would return home, things would go right back to the way they were before, it did not matter. I could enjoy this time. And I would go home knowing that at least one parent showed me that I do, in fact, mean something more to them than just one of two spawn they were saddled with because Mom wanted <em>a</em> baby. An accessory of flesh and bone and blood. <br><br>But, babies grow up and often become less cute and squishy, and no longer totally dependent on you for survival.<br><br></div>\n<div>When Baby becomes their own person, things get complicated.<br><br><br></div>\n<h1 class=\"align-center\">II.</h1>\n<div>The last time we were in a hospital room together, it was her turn. She couldn't speak. Her skin was so dry it stiffened, and her whole forearm shifted when I touched it.<br><br></div>\n<div>Before she fell into the coma, she seemed so content. Euphoric. She asked me to promise her that I would keep making art, and I promised.<br><br></div>\n<div>My aunt sniffled in the corner.<br><br></div>\n<div>I paced the room, waiting. Would she live? Would she die?<em><br></em></div>\n<div>I was eighteen.<br><br></div>\n<div>I never got time alone with her again. <br><br>When it was my turn in hospital, it was just us—Mom and Daughter. Nobody was afraid that I would actually die; the girl whose parents were told that if they delayed even an hour in bringing me in that their daughter would be dead. It was unlikely. I was too young, I guess. But a 48-year-old woman who smoked for 32 years, got inoperable lung cancer, and was given six months to live but survived another three-and-a-half years needed <em>goodbyes.</em> It was our last chance, whether we accepted it or not.<br><br></div>\n<div>On day three of the coma, I paced in and out of her hospital room. One of my cousins tried to comfort me. <br><br></div>\n<div>Her body flung forward and I ran, screaming, toward her, begging her to wake up. A nurse bolted into the room, forcing her body back onto the thin mattress. <br><br><em>Wake up! Wake up, please! </em> <br><br>I wanted \"our turn\". Just us. I wanted her to open her eyes. I wanted her to stay with me.<br><br>I needed more time. <br><br><em>We were only just beginning.</em><br><br>I was just starting to grow up,<em> I promise. <br><br></em></div>\n<h1 class=\"align-center\">III.</h1>\n<div>Christmas was her favorite time of year. She would blast Elvis Presley Christmas songs while she and I decorated the artificial fir tree with antique ornaments she finally let me touch for the first time.<br><br></div>\n<div>I was sixteen.<br><br></div>\n<div>She would sing along, off-key, and I would listen, not yet secure enough to sing along with her. <br><br></div>\n<div>The windows were open and a cool Florida breeze leaked in through the screens. <br><br></div>\n<div>I remember this moment with her most. Wordless time, doing <em>anything</em> together. Something she loved.<br><br></div>\n<div>But we did not get more time. We never got another moment alone in a hospital together. And we never had enough time outside of sterile walls. <br><br></div>\n<div>I was too young, too ignorant, and too selfish. And she smoked too much. <br><br></div>\n<div><br><hr><br>“Then It Was Over” is an early draft of a brief narrative essay I’m working on.</div>",
            "image": "https://segwrites.com/media/posts/13/pexels-iriser-798124.jpg",
            "author": {
                "name": "Sara Eatherton-Goff"
            },
            "tags": [
                   "essay"
            ],
            "date_published": "2021-04-13T09:00:00-07:00",
            "date_modified": "2025-06-25T15:56:17-07:00"
        }
    ]
}
